; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-2-2-9)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	truck1 - truck
	truck2 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-2 - location
	p1-0 - location
	p2-1 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s2)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at package1 s2)
	(at package2 s1)
	(at package3 s0)
	(at package4 s0)
	(at package5 s2)
	(at package6 s1)
	(at package7 s1)
	(at package8 s0)
	(at package9 s0)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 85)
	(= (time-to-walk p0-2 s0) 85)
	(= (time-to-walk s2 p0-2) 28)
	(= (time-to-walk p0-2 s2) 28)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 35)
	(= (time-to-walk p1-0 s1) 35)
	(= (time-to-walk s0 p1-0) 73)
	(= (time-to-walk p1-0 s0) 73)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 16)
	(= (time-to-walk p2-1 s2) 16)
	(= (time-to-walk s1 p2-1) 79)
	(= (time-to-walk p2-1 s1) 79)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 95)
	(= (time-to-drive s1 s0) 95)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 74)
	(= (time-to-drive s2 s0) 74)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 91)
	(= (time-to-drive s1 s2) 91)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s1)
	(at truck1 s1)
	(at truck2 s0)
	(at package1 s1)
	(at package2 s0)
	(at package3 s2)
	(at package4 s0)
	(at package6 s0)
	(at package7 s1)
	(at package8 s1)
	(at package9 s0)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 4  (driven))) (* 4  (walked))))

)

; plan
1. (board-truck driver2 truck1 s2)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 5 of 12
2. (load-truck package1 truck1 s2)
   deleted: (at package1 s2)
   added: (in package1 truck1)
   goals met: 5 of 12
3. (drive-truck truck1 s2 s1 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (driven) from 0 to 91
   goals met: 6 of 12
4. (unload-truck package1 truck1 s1)
   deleted: (in package1 truck1)
   added: (at package1 s1)
   goals met: 7 of 12
5. (load-truck package2 truck1 s1)
   deleted: (at package2 s1)
   added: (in package2 truck1)
   goals met: 7 of 12
6. (load-truck package6 truck1 s1)
   deleted: (at package6 s1)
   added: (in package6 truck1)
   goals met: 7 of 12
7. (drive-truck truck1 s1 s0 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (driven) from 91 to 186
   goals met: 6 of 12
8. (unload-truck package2 truck1 s0)
   deleted: (in package2 truck1)
   added: (at package2 s0)
   goals met: 7 of 12
9. (unload-truck package6 truck1 s0)
   deleted: (in package6 truck1)
   added: (at package6 s0)
   goals met: 8 of 12
10. (load-truck package3 truck1 s0)
   deleted: (at package3 s0)
   added: (in package3 truck1)
   goals met: 8 of 12
11. (load-truck package8 truck1 s0)
   deleted: (at package8 s0)
   added: (in package8 truck1)
   goals met: 8 of 12
12. (drive-truck truck1 s0 s1 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (driven) from 186 to 281
   goals met: 9 of 12
13. (unload-truck package8 truck1 s1)
   deleted: (in package8 truck1)
   added: (at package8 s1)
   goals met: 10 of 12
14. (drive-truck truck1 s1 s2 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (driven) from 281 to 372
   goals met: 9 of 12
15. (unload-truck package3 truck1 s2)
   deleted: (in package3 truck1)
   added: (at package3 s2)
   goals met: 10 of 12
16. (drive-truck truck1 s2 s1 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (driven) from 372 to 463
   goals met: 11 of 12
17. (disembark-truck driver2 truck1 s1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s1) (empty truck1)
   goals met: 12 of 12
